Revit 2027 API
CableTraySizeIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual MEPSize Current { get; }
Public Overridable ReadOnly Property Current As MEPSize
	Get
public:
virtual property MEPSize^ Current {
	MEPSize^ get ();
}
abstract Current : MEPSize with get
override Current : MEPSize with get
Property Value
MEPSize
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace